Ran Plan for dir: `infrastructure/terraform/internal/storybook` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.composition_storybook.aws_cloudfront_distribution.s3_distribution will be created
+ resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "storybook.rebrowse.dev",
          + "www.storybook.rebrowse.dev",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "insight-composition-storybook (Managed by Terraform)"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "environment" = "Internal"
          + "name"        = "Storybook"
        }
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "insight-composition-storybook-origin"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers      = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = "insight-composition-storybook.s3.amazonaws.com"
          + origin_id   = "insight-composition-storybook-origin"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E3I429GL6QITXS"
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2019"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.composition_storybook.aws_route53_record.cdn_records["storybook.rebrowse.dev"] will be created
+ resource "aws_route53_record" "cdn_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "storybook.rebrowse.dev"
      + type            = "A"
      + zone_id         = "Z082926732A4WWMKU2W2Q"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.composition_storybook.aws_route53_record.cdn_records["www.storybook.rebrowse.dev"] will be created
+ resource "aws_route53_record" "cdn_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.storybook.rebrowse.dev"
      + type            = "A"
      + zone_id         = "Z082926732A4WWMKU2W2Q"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.composition_storybook.github_actions_secret.cloudfront_distribution_id will be created
+ resource "github_actions_secret" "cloudfront_distribution_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Insight"
      + secret_name     = "AWS_CLOUDFRONT_COMPOSITION_STORYBOOK_DISTRIBUTION_ID"
      + updated_at      = (known after apply)
    }

  # module.composition_storybook.module.certificate.aws_acm_certificate.certificate will be created
+ resource "aws_acm_certificate" "certificate" {
      + arn                       = (known after apply)
      + domain_name               = "storybook.rebrowse.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "storybook.rebrowse.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.storybook.rebrowse.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "www.storybook.rebrowse.dev",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.composition_storybook.module.certificate.aws_acm_certificate_validation.certificate_validation will be created
+ resource "aws_acm_certificate_validation" "certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.composition_storybook.module.certificate.aws_route53_record.validation_records["storybook.rebrowse.dev"] will be created
+ resource "aws_route53_record" "validation_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z082926732A4WWMKU2W2Q"
    }

  # module.composition_storybook.module.certificate.aws_route53_record.validation_records["www.storybook.rebrowse.dev"] will be created
+ resource "aws_route53_record" "validation_records" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z082926732A4WWMKU2W2Q"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/terraform/internal/storybook`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.rebrowse.dev/lock?id=insights-io%252FInsight%252Finfrastructure%252Fterraform%252Finternal%252Fstorybook%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/terraform/internal/storybook`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
